		IDENTIFICATION DIVISION.
		PROGRAM-ID. READ-VSAM.
		
		ENVIRONMENT DIVISION.
		INPUT-OUTPUT SECTION.
		FILE-CONTROL.
		SELECT INPUT-FILE
			ASSIGN TO "input.vsam"
			ORGANIZATION IS INDEXED
            RECORD KEY IS INPUT-KEY
			ACCESS MODE IS SEQUENTIAL.
		
		DATA DIVISION.
		FILE SECTION.
		FD INPUT-FILE
			RECORDING MODE IS F
			LABEL RECORDS ARE OMITTED.
		01 INPUT-RECORD.
            05 INPUT-KEY PIC X(10).			
			05 INPUT-FIELD PIC X(80).
		
		WORKING-STORAGE SECTION.
        01 END-OF-FILE PIC X(1) VALUE 'N'.
		01 WS-KEY PIC X(10).
		01 WS-FOUND PIC X(1).
		
		PROCEDURE DIVISION.
		OPEN INPUT INPUT-FILE.
		PERFORM UNTIL END-OF-FILE = 'Y'
			READ INPUT-FILE KEY IS WS-KEY
				AT END MOVE 'Y' TO END-OF-FILE
				NOT AT END MOVE 'N' TO WS-FOUND
			IF WS-FOUND = 'Y'
				DISPLAY INPUT-FIELD
		END-PERFORM
		CLOSE INPUT-FILE.
		STOP RUN.
		